#include<stdio.h>
#include<conio.h>
 
int main()
{
   int year;

   printf("\n Please enter a year ( like 1997): ");
   scanf("%d", &year);

   if (((year % 4) == 0) && ((year % 100) != 0) || ((year % 400) == 0)) 
    {
      printf("\n %d is a LEAP YEAR", year);
    }

   else 
    {
      printf("\n %d is not a LEAP YEAR", year);
    } 
 }

/* যেকোন একটি শর্ত পূরণ করলেই আমরা ঐ সালকে নিঃসন্দেহে অধিবর্ষ বলতে পারবেন।শর্ত দুটিঃ
  
    ১। যদি ঐ সালকে ৪ দ্বারা ভাগ করে ভাগশেষ শূণ্য হয়;(শুধু তা-ই নয়)এবং ১০০ দ্বারা ভাগ করে ভাগশেষ শূণ্য না হয়। অথবা
    ২। যদি ঐ সালকে ৪০০ দ্বারা ভাগ করে ভাগশেষ শূণ্য হয়।

 ব্যস,হয়ে গেল।যেকোন একটা শর্ত মেনে চললেই ঐ সাল লিপ-ইয়ার বা অধিবর্ষ।আর যদি একটাও শর্ত পূরণ না করতে পারে তাহলে ঐ সালা(সাল) লিপ-ইয়ার না।*/